import React, { Component } from "react";
import "./about.css";
class About extends Component {
  state = {};
  render() {
    return (
      <div className='about'>
        <div className='welcome'>
          <div className='overlay'></div>
          <div className='about-content header-content'>
            <h2 className='text-center'>من نحن وما هى اهدافنا</h2>
            <p className='text-center'>
              هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص
              العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد
              الحروف التى يولدها التطبيق.
            </p>
          </div>
        </div>
        <div className='container-fluid px-0'>
          <div className='history'>
            <h3 className='text-center def-h3'>تعرف علينا وايضا قم بالإطلاع على تاريخ الشركة </h3>

            <div className='row w-100 mx-0'>
              <div className='col-md-6 '>
                <div className='text-about view-content-text '>
                  <p>
                    هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من
                    مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى
                    إضافة إلى زيادة عدد الحروف التى يولدها التطبيق. إذا كنت تحتاج إلى عدد أكبر من
                    الفقرات يتيح لك مولد النص العربى زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما
                    ولا يحوي أخطاء لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص، حيث
                    يحتاج العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع. ومن هنا
                    وجب على المصمم أن يضع نصوصا مؤقتة على التصميم ليظهر للعميل الشكل كاملاً،دور مولد
                    النص العربى أن يوفر على المصمم عناء البحث عن نص بديل لا علاقة له بالموضوع الذى
                    يتحدث عنه التصميم فيظهر بشكل لا يليق. هذا النص يمكن أن يتم تركيبه على أي تصميم
                    دون مشكلة فلن يبدو وكأنه نص منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم. لأنه
                    مازال نصاً بديلاً ومؤقتاً.
                  </p>
                </div>
                
              </div>
              <div className='col-md-6 px-0'>
                <img className='w-100' src={require("../../assets/images/company.png")} alt='' />
              </div>
              <div className="container">
              <div className='mid-p view-content-text'>
                  <p>
                  هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد
                  النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى
                  زيادة عدد الحروف التى يولدها التطبيق. إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح
                  لك مولد النص العربى زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء
                  لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج العميل فى
                  كثير من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع. ومن هنا وجب على المصمم أن
                  يضع نصوصا مؤقتة على التصميم ليظهر للعميل الشكل كاملاً،دور مولد النص العربى أن يوفر
                  على المصمم عناء البحث عن نص بديل لا علاقة له بالموضوع الذى يتحدث عنه التصميم فيظهر
                  بشكل لا يليق. هذا النص يمكن أن يتم تركيبه على أي تصميم دون مشكلة فلن يبدو وكأنه نص
                  منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم. لأنه مازال نصاً بديلاً ومؤقتاً.هذا
                  النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص
                  العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة
                  عدد الحروف التى يولدها التطبيق. إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد
                  النص العربى زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء لغوية،
                  مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج العميل فى كثير من
                  الأحيان أن يطلع على صورة حقيقية لتصميم الموقع. ومن هنا وجب على المصمم أن يضع نصوصا
                  مؤقتة على التصميم ليظهر للعميل الشكل كاملاً،دور مولد النص العربى أن يوفر على
                  المصمم عناء البحث عن نص بديل لا علاقة له بالموضوع الذى يتحدث عنه التصميم فيظهر
                  بشكل لا يليق. هذا النص يمكن أن يتم تركيبه على أي تصميم دون مشكلة فلن يبدو وكأنه نص
                  منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم. لأنه مازال نصاً بديلاً ومؤقتاً.
                  </p>
                </div>
              </div>
            </div>
          </div>
        </div>
        <div className="img-about">
            <img className="w-100" src={require('../../assets/images/main-company.png')} alt=""/>
        </div>
        <div className="container products">
            <div>
                <h3 className="def-h3  text-center">افضل الخامات المنتجة</h3>
            </div>
            <div className="row">
                <div className="col-md-6 p-1 ">
                    <img className="w-100" src={require('../../assets/images/glass1.png')} alt=""/>
                </div>
                <div className="col-md-6 p-1 ">
                    <img className="w-100" src={require('../../assets/images/glass2.png')} alt=""/>
                </div>
                <div className="col-md-6 p-1 ">
                    <img className="w-100" src={require('../../assets/images/glass3.png')} alt=""/>
                </div>
                <div className="col-md-6 p-1 ">
                    <img className="w-100" src={require('../../assets/images/glass4.png')} alt=""/>
                </div>
            </div>
        </div>
      </div>
    );
  }
}

export default About;
